In [1]:
#install Pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
#import packages
import pandas as pd
import numpy as np

lst=[10,20,30,40]
arr1=np.array(lst)

In [3]:
pd.Series([lst,lst,lst])

0    [10, 20, 30, 40]
1    [10, 20, 30, 40]
2    [10, 20, 30, 40]
dtype: object

In [4]:
df=pd.DataFrame([lst,lst,lst,lst],columns=["A","B","C","D"])

In [5]:
df

    A   B   C   D
0  10  20  30  40
1  10  20  30  40
2  10  20  30  40
3  10  20  30  40

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
del df

In [8]:
#Series through List
lst=[10,20,30,40,50]
pd.Series(lst)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [9]:
dct={"name":"Tejaswini Phasale","RollNo":150,"Age":20}
pd.Series(dct)

name      Tejaswini Phasale
RollNo                  150
Age                      20
dtype: object

In [10]:
pd.Series(index=["Name","RollNo","Age"],data=["Tejaswini",150,20])

Name      Tejaswini
RollNo          150
Age              20
dtype: object

In [11]:
import pandas as pd
pd.Series(5).repeat(5)

0    5
0    5
0    5
0    5
0    5
dtype: int64

In [12]:
pd.Series([4,5]).repeat([2,3])

0    4
0    4
1    5
1    5
1    5
dtype: int64

In [13]:
type(pd.Series([4,5]).repeat([2,3]).reset_index())

pandas.core.frame.DataFrame

In [14]:
type(pd.Series([4,5]).repeat([2,3]).reset_index(drop=True))

pandas.core.series.Series

In [15]:
ser=pd.Series(["Tejaswini   ", "Shamrao  ","   Phasale"])
print(ser.str.upper())
print(ser.str.lower())

0    TEJASWINI
1       SHAMRAO
2         PHASALE
dtype: object
0    tejaswini
1       shamrao
2         phasale
dtype: object

In [16]:
#Length of String
for i in ser:
    print(i,"=",len(i))

Tejaswini    = 12
Shamrao   = 9
   Phasale = 10

In [17]:
#Remove the extra spaces(strip function used to remove extra spaces)
ser=ser.str.strip()
print(ser)

for i in ser:
    print(i,"=",len(i))

0    Tejaswini
1      Shamrao
2      Phasale
dtype: object
Tejaswini = 9
Shamrao = 7
Phasale = 7

In [18]:
print(pd.Series(['10/03/1983','10/03/1994','29/10/1998']).str.split('/'))

0    [10, 03, 1983]
1    [10, 03, 1994]
2    [29, 10, 1998]
dtype: object

In [19]:
#Contains Function
ser=pd.Series(["Tejaswini Phasale","Data@Scientist","GFG","Machine@Learning"])
ser.str.contains("@")

0    False
1     True
2    False
3     True
dtype: bool

In [20]:
#Replace Function
ser=pd.Series(["Tejaswini Phasale","Data@Scientist","GFG","Machine@Learning"])
ser.str.replace('@',' ')

0    Tejaswini Phasale
1       Data Scientist
2                  GFG
3     Machine Learning
dtype: object

In [21]:
#count function
ser.str.count('a')

0    3
1    2
2    0
3    2
dtype: int64

In [22]:
#startswith and endswith
ser.str.startswith("Tej")
ser.str.endswith("g")

0    False
1    False
2    False
3     True
dtype: bool

In [23]:
pd.Series(["Tejaswini","Tejaswini","Phasale","xyz","abcd"])
ser.str.count("Tejaswini")

0    1
1    0
2    0
3    0
dtype: int64

In [24]:
ser=pd.Series(["Tejaswini","Tejaswini","Phasale","xyz","abcd"])

In [25]:
type(ser.to_list())

list

In [26]:
lst=["gfg","Tejaswini","Phasale","Data Scientist"]
df=pd.DataFrame(lst)
print(df)

                0
0             gfg
1       Tejaswini
2         Phasale
3  Data Scientist

In [27]:
lst=[[1,"gfg","xyz"],[2,"Tejaswini","abc"],[3,"Phasale","gd"],[4,"Data Scientist","yes"]]
df=pd.DataFrame(lst)
print(df)

   0               1    2
0  1             gfg  xyz
1  2       Tejaswini  abc
2  3         Phasale   gd
3  4  Data Scientist  yes

In [28]:
#Creating DataFrame from dict of ndarraylists
data={'name':["Tom","nick","krish","jack"],"Age":[20,21,19,18],"Address":["abc","xyz","fgx","hgf"]}
df=pd.DataFrame(data)
print(df)

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [29]:
#Slicing in DataFrames Using Iloc and Loc
data={'one' :pd.Series([1,2,3,4]),
     'two'  :pd.Series([10,20,30,40,]),
     'three':pd.Series([100,200,300,400])}

In [30]:
pd.DataFrame(data)

   one  two  three
0    1   10    100
1    2   20    200
2    3   30    300
3    4   40    400

In [31]:
#Basic loc opration
df.loc[1:2]

    name  Age Address
1   nick   21     xyz
2  krish   19     fgx

In [32]:
df.loc[2:4]

    name  Age Address
2  krish   19     fgx
3   jack   18     hgf

In [33]:
df.loc[1:2,'name':'age']

    name
1   nick
2  krish

In [34]:
df.iloc[:,:]

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [35]:
df.iloc[1:-1,:]

    name  Age Address
1   nick   21     xyz
2  krish   19     fgx

In [36]:
df.iloc[1:,:]

    name  Age Address
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [37]:
df

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [38]:
df.iloc[:,2:3]

  Address
0     abc
1     xyz
2     fgx
3     hgf

In [39]:
df

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [40]:
df.iloc[[0,3],[0,2]]

   name Address
0   Tom     abc
3  jack     hgf

In [41]:
data={
    'one'    :pd.Series([1,2,3,4]),
    'two'    :pd.Series([10,20,30,40]),
    'three'  :pd.Series([100,20,300,400]),
    'four'   :pd.Series([1000,2000,3000,4000])
}
df=pd.DataFrame(data)

In [42]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [43]:
df['two']

0    10
1    20
2    30
3    40
Name: two, dtype: int64

In [44]:
df[df['two']>20]

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [45]:
#Using conditions work with loc basically
df.loc[df['two'] > 20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [46]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [47]:
l=[12,13,14,15]
df['six']=l

In [48]:
df

   one  two  three  four  six
0    1   10    100  1000   12
1    2   20     20  2000   13
2    3   30    300  3000   14
3    4   40    400  4000   15

In [49]:
del df['six']

In [50]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [51]:
l=[101,102,103,104]
df['five']=l

In [52]:
df

   one  two  three  four  five
0    1   10    100  1000   101
1    2   20     20  2000   102
2    3   30    300  3000   103
3    4   40    400  4000   104

In [53]:
df.pop('five')

0    101
1    102
2    103
3    104
Name: five, dtype: int64

In [54]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [55]:
#Addition of rows

df1 = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','b'])
df2 = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','b'])

result = pd.concat([df1, df2])
print(result)

   a  b
0  1  2
1  3  4
2  5  6
0  1  2
1  3  4
2  5  6

In [56]:
data = {
    'one': pd.Series([1, 2, 3, 4]),
    'two': pd.Series([10, 20, 30, 40]),
    'three': pd.Series([100, 20, 300, 400]),
    'four': pd.Series([1000, 2000, 3000, 4000])
}

# Creating the DataFrame
df = pd.DataFrame(data)

# Dropping rows with index 2 and 3
df.drop([2, 3], axis=0, inplace=True)

# Displaying the resulting DataFrame
print(df)

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000

In [57]:
df.drop(['one','three'],axis=1,inplace=True)

In [58]:
df.T

         0     1
two     10    20
four  1000  2000

In [62]:
data = {
    'one': pd.Series([1, 2, 3, 4]),
    'two': pd.Series([10, 20, 30, 40]),
    'three': pd.Series([100, 20, 300, 400]),
    'four': pd.Series([1000, 2000, 3000, 4000])
}

# Creating the DataFrame
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [63]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [64]:
df.ndim

2

In [65]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [66]:
df.shape

(4, 4)

In [67]:
df.head()

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [68]:
df.tail()

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [69]:
df.empty

False

In [73]:
data = {
    'one': pd.Series([1, 2, 3, 4]),
    'two': pd.Series([10, 20, 30, 40]),
    'three': pd.Series([100, 20, 300, 400]),
    'four': pd.Series([1000, 2000, 3000, 4000])
}

# Creating the DataFrame
df = pd.DataFrame(data)
df.rename(columns={'one':'One','two':'Two','three':'Three','four':'Four'}, inplace=True , index={0:'a',1:'b',2:'c',3:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20     20  2000
c    3   30    300  3000
d    4   40    400  4000

In [85]:
data = {
    'one': pd.Series([1, 3, 4, 2]),
    'two': pd.Series([ 40,30,10, 20]),
    'three': pd.Series([100, 20, 300, 40]),
    'four': pd.Series([1000, 2000, 3000, 4000])
}

# Creating the DataFrame
df = pd.DataFrame(data)
df.sort_values(by='two',ascending=False)
df.sort_values(by=['one','two'])
df.sort_values(by=['one'],kind='heapsort')

   one  two  three  four
0    1   40    100  1000
3    2   20     40  4000
1    3   30     20  2000
2    4   10    300  3000

In [88]:
cricket={
    'Team'  :['India','India','Australia','SA','SA','SA','SA','NZ','NZ','NZ','India'],
    'Rank'  :[2,3,1,2,3,4,1,1,2,4,1],
    'Year'  :[2014,2015,2014,2015,2016,2016,2017,2016,2015,2016,2017],
    'Points':[876,801,891,815,890,765,879,987,789,908,823]
}
df=pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3          SA     2  2015     815
4          SA     3  2016     890
5          SA     4  2016     765
6          SA     1  2017     879
7          NZ     1  2016     987
8          NZ     2  2015     789
9          NZ     4  2016     908
10      India     1  2017     823

In [91]:
df.groupby('Team').groups

{'Australia': [2], 'India': [0, 1, 10], 'NZ': [7, 8, 9], 'SA': [3, 4, 5, 6]}

In [95]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [100]:
df.groupby('Team').groups

{'Australia': [2], 'India': [0, 1, 10], 'NZ': [7, 8, 9], 'SA': [3, 4, 5, 6]}

In [107]:
df.groupby('Team')['Points'].sum().sort_values(ascending=False)

Team
SA           3349
NZ           2684
India        2500
Australia     891
Name: Points, dtype: int64

In [109]:
groups=df.groupby('Team')
groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])

C:\Users\DELL\AppData\Local\Temp\ipykernel_15576\686103487.py:2: FutureWarning: The provided callable <function sum at 0x00000178F5ABAAC0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\DELL\AppData\Local\Temp\ipykernel_15576\686103487.py:2: FutureWarning: The provided callable <function mean at 0x00000178F5ABBBA0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\DELL\AppData\Local\Temp\ipykernel_15576\686103487.py:2: FutureWarning: The provided callable <function std at 0x00000178F5ABBCE0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\DELL\AppData\Local\Temp\ipykernel_15576\686103487.py:2: FutureWarning: The provided callable <function max at 0x00000178F5ABB1A0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\DELL\AppData\Local\Temp\ipykernel_15576\686103487.py:2: FutureWarning: The provided callable <function min at 0x00000178F5ABB2E0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])

            sum        mean        std  max  min
Team
Australia   891  891.000000        NaN  891  891
India      2500  833.333333  38.552994  876  801
NZ         2684  894.666667  99.671126  987  789
SA         3349  837.250000  58.425879  890  765

In [111]:
df.groupby('Team').filter(lambda x:len(x)==4)

  Team  Rank  Year  Points
3   SA     2  2015     815
4   SA     3  2016     890
5   SA     4  2016     765
6   SA     1  2017     879